[
  {
    "title": "Discover Bali: 5-Day Luxury Escape",
    "overview": "Indulge in Bali’s tropical paradise with private beachfront stays at Bali Sunset Resort, cultural immersion at Uluwatu Temple’s cliffside Kecak fire dance, and adrenaline-fueled snorkeling at Nusa Penida’s Manta Point. Wander through UNESCO-listed Tegalalang Rice Terraces, discover artisan villages in Ubud, and unwind with sunset cocktails at Seminyak’s infinity pools. Includes VIP airport transfers, 4-star sea-view suites, and a gourmet Balinese feast under the stars. Perfect for couples and adventurers seeking luxury amid jungles, waterfalls, and sacred temples.",
    "destination": {
      "country": "Indonesia",
      "city": "Bali",
      "map": "https://maps.google.com/?q=Bali"
    },
    "food": {
  "description": "Bali offers a vibrant fusion of flavors inspired by its rich Hindu heritage and tropical setting. Whether you're savoring Halal-friendly seafood, plant-based Balinese dishes, or traditional meat specialties, this journey caters to all dietary preferences with scenic mealtime experiences.",
  "meal_schedule": {
    "breakfast": {
      "time": "7:30 AM – 9:30 AM",
      "options": ["Halal", "Vegan", "Non-Vegan"]
    },
    "lunch": {
      "time": "12:30 PM – 2:00 PM",
      "options": ["Halal", "Vegan", "Non-Vegan"]
    },
    "dinner": {
      "time": "7:00 PM – 9:00 PM",
      "options": ["Halal", "Vegan", "Non-Vegan"]
    }
  }
},
    "country_history": "Indonesia, an archipelago of over 17,000 islands, has a rich history shaped by diverse cultures, trade, and colonization. Known for its ancient Hindu and Buddhist kingdoms, such as Srivijaya and Majapahit, Indonesia later became a major hub for spice trade, attracting European powers like the Dutch, who colonized the region for over 300 years. Indonesia declared independence in 1945 and is now the world's largest island country, celebrated for its cultural diversity, natural beauty, and vibrant traditions.",
    "duration": "5 Days, 4 Nights",
    "available_dates": [
      "2025-04-10",
      "2025-05-15",
      "2025-06-20"
    ],
    "price": {
      "currency": "USD",
      "per_person": 899,
      "group_discount": {
        "min_people": 4,
        "discount_percent": 10
      }
    },
    "banner_img": "https://i.ibb.co/mCcVFWGJ/bali.jpg",
    "IMG1":"https://i.ibb.co.com/RpgMWDP0/d3.jpg",
    "IMG2": "https://i.ibb.co.com/gZV2x98R/asia-Indonesia-bali2.jpg",
    "IMG3": "https://i.ibb.co.com/zVRL93kJ/Bali-itinerary-Seminyak.jpg",
    "IMG4": "https://i.ibb.co.com/whf7mg6q/583ueyw12nyi0fm5fj8o9u4nzj0v-Candle-Light-Dinner-1.jpg",
    "IMG5": "https://i.ibb.co.com/Kp2G5qq5/snndbd82tn4803rsygi37fw4xq5c-couple-cave-900x450.jpg",
    "IMG6": "https://i.ibb.co.com/F42czMx4/Bali-itinerary-Seminyak.jpg",
     
  
    "itinerary": [
      {
        "day": 1,
        "title": "Arrival & Welcome Dinner",
        "description": "Your adventure begins with a warm welcome as you arrive at Ngurah Rai International Airport. Our team will greet you with a traditional Balinese flower garland and transfer you to your luxurious hotel in Seminyak. After settling into your Deluxe Sea View room, unwind with a refreshing tropical drink by the infinity pool. In the evening, enjoy a cultural welcome dinner at a beachside restaurant, featuring authentic Balinese cuisine like *Babi Guling* (suckling pig) and fresh seafood, accompanied by live traditional music under the stars."
      },
      {
        "day": 2,
        "title": "Temple Tour & Waterfalls",
        "description": "Start your day with a hearty breakfast before heading out to explore Bali’s spiritual side. Visit the iconic Uluwatu Temple, perched dramatically on a cliff overlooking the Indian Ocean, where you’ll witness stunning panoramic views and learn about its history from your expert guide. Next, journey to Tegenungan Waterfall, a hidden gem surrounded by lush greenery—perfect for a refreshing dip or a photo session. Cap off the day with a mesmerizing *Kecak* dance performance at sunset, a traditional Balinese fire dance that tells the epic tale of Ramayana."
      },
      {
        "day": 3,
        "title": "Rice Fields & Ubud Art Village",
        "description": "Today, immerse yourself in Bali’s natural beauty and artistic heritage. After breakfast, travel to the UNESCO-listed Tegalalang Rice Terraces, where you’ll stroll through vibrant green paddies and learn about traditional rice farming techniques. Enjoy a local lunch at a family-run warung with views of the terraces. Then, explore Ubud’s art villages—Celuk for silver jewelry, Mas for wood carvings, and Ubud for paintings—where you can watch artisans at work and pick up unique souvenirs. Return to your hotel for a relaxing evening by the beach."
      },
      {
        "day": 4,
        "title": "Nusa Penida Snorkeling Adventure",
        "description": "Embark on an unforgettable day trip to Nusa Penida, a pristine island off Bali’s coast. After an early breakfast, take a speedboat to this tropical paradise and dive into the crystal-clear waters for a snorkeling adventure. Swim alongside colorful coral reefs, tropical fish, and maybe even manta rays at Manta Point. Enjoy a beachside picnic lunch prepared by your guide, then visit Kelingking Beach for its breathtaking cliff views. Return to Bali in the late afternoon, with time to relax at the hotel spa before dinner."
      },
      {
        "day": 5,
        "title": "Departure & Farewell",
        "description": "Savor your final morning in Bali with a leisurely breakfast overlooking the ocean. Take some time to explore Seminyak’s trendy boutiques or enjoy a last dip in the pool. Our team will assist with your checkout and provide a private transfer back to the airport, ensuring a smooth departure. As you leave, take with you memories of Bali’s beauty, culture, and luxury—perfect inspiration for your next adventure!"
      }
    ],
    "inclusions": [
      "4-star hotel accommodation",
      "Daily breakfast & 3 dinners",
      "Airport transfers",
      "Guided sightseeing tours",
      "Entrance fees to attractions"
    ],
    "exclusions": [
      "Flights to/from Bali",
      "Personal expenses",
      "Visa fees"
    ],
    "accommodation": {
      "hotel_name": "Bali Sunset Resort",
      "rating": 4.5,
      "room_type": "Deluxe Sea View",
      "photos": [
        "https://i.ibb.co.com/s9PWMnHM/Bali-Hotels-Beach-Pool-View-To-Kuta-Beach.jpg",
        "https://i.ibb.co.com/HD4jNC9Y/493750151.jpg",
        "https://i.ibb.co.com/KpT4DVfd/image-asset.jpg",
        "https://i.ibb.co.com/9kCphQH0/images-3.jpg",
        "https://i.ibb.co.com/W4WG2t6y/images-16.jpg",
        "https://i.ibb.co.com/0jFVhw7J/467489869.jpg"
      ]
    },
    "reviews": [
      {
        "id": 1,
        "user": {
          "name": "Emma Wilson",
          "location": "Vancouver, Canada",
          "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
          "traveler_type": "Couple"
        },
        "rating": 5,
        "title": "Magical cherry blossom experience!",
        "review_text": "The cherry blossoms were breathtaking, and the cultural activities were so immersive. The tea ceremony was a highlight!",
        "date": "2024-04-01",
        "verified_booking": true,
        "photos": [
          "/reviews/tokyo-1.jpg"
        ],
        "helpful_count": 18,
        "response": {
          "text": "Thank you, Emma! We're so glad you enjoyed the cherry blossoms.",
          "date": "2024-04-03"
        }
      },
      {
        "id": 2,
        "user": {
          "name": "James Taylor",
          "location": "Auckland, New Zealand",
          "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
          "traveler_type": "Solo Traveler"
        },
        "rating": 4,
        "title": "Great tour, but busy",
        "review_text": "The tour was fantastic, but Tokyo was very crowded during cherry blossom season. Still, an amazing experience!",
        "date": "2024-04-10",
        "verified_booking": true,
        "photos": [],
        "helpful_count": 9,
        "response": {
          "text": "Thank you for your feedback, James! We'll work on managing the crowds better.",
          "date": "2024-04-12"
        }
      }
    ]
  },
  
{
  "title": "Swiss Alps Adventure: 7-Day Expedition",
  "overview": "Embark on a Swiss Alpine adventure, conquering the iconic Matterhorn on skis, riding the Glacier Express to Jungfraujoch’s \"Top of Europe,\" and unwinding in a 5-star chalet with breathtaking panoramic views. Trek across the shimmering Gorner Glacier, savor authentic fondue dinners in Zermatt’s charming car-free village, and explore the medieval beauty of Chillon Castle on the shores of Lake Geneva. This luxury package includes private guided hikes, champagne toasts at 3,883 meters, and cozy stays in a mountain lodge with fireplace suites. Perfect for thrill-seekers and nature enthusiasts craving the grandeur of the Swiss Alps and the precision of Swiss hospitality.",
  "destination": {
    "country": "Switzerland",
    "city": "Zermatt",
    "map": "https://maps.google.com/?q=Zermatt"
  },
  "food": {
  "description": "Experience the rich culinary traditions of the Swiss Alps with gourmet meals featuring local specialties. Enjoy hearty mountain breakfasts, traditional Swiss lunches, and elegant fondue dinners with premium cheeses from local dairy farms. Our meals highlight seasonal alpine ingredients and cater to all dietary needs with vegetarian, vegan, and gluten-free options available.",
  "meal_schedule": {
    "breakfast": {
      "time": "7:00 AM – 9:00 AM",
      "options": ["Swiss-style buffet", "Vegetarian", "Gluten-free"]
    },
    "lunch": {
      "time": "12:00 PM – 2:00 PM",
      "options": ["Mountain picnic", "Restaurant dining", "Vegan"]
    },
    "dinner": {
      "time": "7:00 PM – 9:00 PM",
      "options": ["Fondue night", "Raclette feast", "Gourmet Swiss cuisine"]
    }
  },
  "dining_experiences": [
    "Sunset champagne toast at Matterhorn Glacier Paradise",
    "Traditional alpine hut lunch during hikes",
    "Gourmet fondue dinner with Matterhorn views"
  ]
},
  "country_history": "Switzerland, known for its neutrality and stunning Alpine landscapes, has a history of independence dating back to 1291 when the Swiss Confederation was formed. The country has maintained its neutrality through major European conflicts, including both World Wars. Renowned for its political stability, banking sector, and precision engineering, Switzerland is also celebrated for its cultural diversity, with four official languages: German, French, Italian, and Romansh. Its picturesque mountains, lakes, and cities like Zurich and Geneva make it a global symbol of natural beauty and prosperity.",
  "duration": "7 Days, 6 Nights",
  "available_dates": [
    "2025-02-15",
    "2025-03-10",
    "2025-04-05"
  ],
  "price": {
    "currency": "USD",
    "per_person": 1899,
    "group_discount": {
      "min_people": 5,
      "discount_percent": 12
    }
  },
  

  "banner_img": "https://i.ibb.co.com/ZpGrRDVg/istockphoto-584784714-612x612-1.jpg",
  "IMG1":"https://i.ibb.co.com/CsmsDX2G/images-1.jpg",
  "IMG2": "https://i.ibb.co.com/Jwx0VwYz/images-3.jpg",
  "IMG3": "https://i.ibb.co.com/rGKW5NtT/images.jpg",
  "IMG4": "https://i.ibb.co.com/KjFV94xz/Alpine-Pass-Route1-300026-950px-16x7.jpg",
  "IMG5": "https://i.ibb.co.com/8n7PRG1n/image-processing20231219-2-2o0aqy.jpg",
  "IMG6": "https://i.ibb.co.com/y1xdvbC/images-2.jpg",
  "itinerary": [
    {
      "day": 1,
      "title": "Arrival & Mountain Retreat",
      "description": "Your Swiss adventure begins as you land in Zurich, where our team will meet you at the airport. Enjoy a scenic train ride through rolling hills to Zermatt, a charming car-free village nestled at the foot of the Matterhorn. Check into your luxurious mountain lodge, where a roaring fireplace and panoramic views await. After settling in, take a short guided walk through Zermatt’s cobblestone streets, followed by a hearty Swiss dinner featuring fondue and local wines."
    },
    {
      "day": 2,
      "title": "Hiking & Glacier Exploration",
      "description": "After a delicious breakfast of fresh croissants and alpine cheese, lace up your boots for a guided hike along the Matterhorn trails. Marvel at the jagged peaks and pristine forests as your guide shares tales of the region’s mountaineering history. Reach the Gorner Glacier, a shimmering expanse of ice, where you’ll explore its crevasses and learn about its geological significance. Return to the lodge for a warm lunch and an afternoon of relaxation with stunning mountain views."
    },
    {
      "day": 3,
      "title": "Skiing the Matterhorn Slopes",
      "description": "Today, hit the slopes of Zermatt, one of the world’s premier ski destinations. After breakfast, gear up with your included ski pass and enjoy a full day skiing or snowboarding on trails suited to all levels, from gentle beginner runs to challenging black diamonds. Take in the awe-inspiring sight of the Matterhorn as you glide down. Après-ski, unwind with hot chocolate or mulled wine at a cozy alpine chalet before a gourmet dinner at the lodge."
    },
    {
      "day": 4,
      "title": "Jungfraujoch: Top of Europe",
      "description": "Embark on a full-day excursion to Jungfraujoch, known as the ‘Top of Europe.’ Travel by train through picturesque valleys to this high-altitude wonder, standing at 3,454 meters. Explore the Ice Palace carved into the glacier, visit the Sphinx Observatory for panoramic views of the Aletsch Glacier, and enjoy a snow play area. Savor a traditional Swiss lunch at the summit before returning to Zermatt for a quiet evening."
    },
    {
      "day": 5,
      "title": "Lake Geneva & Montreux",
      "description": "Take a break from the mountains with a day trip to Lake Geneva and Montreux. After breakfast, journey by train to this stunning lakeside region, where you’ll visit the medieval Chillon Castle, perched on the water’s edge. Stroll along the flower-lined promenade of Montreux, famous for its jazz festival, and enjoy a lakeside lunch featuring fresh perch. Return to Zermatt in the evening for a relaxing night at the lodge."
    },
    {
      "day": 6,
      "title": "Matterhorn Glacier Paradise",
      "description": "Ascend to the Matterhorn Glacier Paradise, Europe’s highest cable car station at 3,883 meters. After breakfast, ride the cable car to this snowy summit, where you’ll enjoy 360-degree views of the Alps, including peaks in France and Italy. Explore the glacier cave, try summer skiing (season permitting), or simply soak in the crisp alpine air. Return to Zermatt for a farewell dinner featuring Swiss specialties like raclette and chocolate fondue."
    },
    {
      "day": 7,
      "title": "Departure",
      "description": "Enjoy a leisurely breakfast with one last view of the Matterhorn before checking out of your lodge. Our team will escort you back to Zurich by train, giving you time to reflect on your alpine adventure. Arrive at the airport with plenty of time for your departure, carrying memories of Switzerland’s majestic landscapes and luxurious comforts."
    }
  ],
  "inclusions": [
    "Luxury hotel stays",
    "Breakfast & dinner",
    "Ski pass"
  ],
  "exclusions": [
    "Flights to/from Switzerland",
    "Ski equipment rental"
  ],
  "accommodation": {
    "hotel_name": "Matterhorn View Lodge",
    "rating": 5,
    "room_type": "Panoramic Suite",
    "photos": [
      "https://i.ibb.co.com/RGvm3zXH/spa-winter-jpg.jpg",
      "https://i.ibb.co.com/RTGYgFgT/mp1-8323-720-2x.jpg",
      "https://i.ibb.co.com/svFC9Zqd/421669322.jpg",
      "https://i.ibb.co.com/1fCLxF1s/images-4-4.jpg",
      "https://i.ibb.co.com/JRJ47qfN/images-5-4.jpg",
      "https://i.ibb.co.com/G45FGxm1/116778112.jpg"
    ]
  },
  "reviews": [
    {
      "id": 1,
      "user": {
        "name": "Emma Wilson",
        "location": "Vancouver, Canada",
        "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
        "traveler_type": "Couple"
      },
      "rating": 5,
      "title": "Magical cherry blossom experience!",
      "review_text": "The cherry blossoms were breathtaking, and the cultural activities were so immersive. The tea ceremony was a highlight!",
      "date": "2024-04-01",
      "verified_booking": true,
      "photos": [
        "/reviews/tokyo-1.jpg"
      ],
      "helpful_count": 18,
      "response": {
        "text": "Thank you, Emma! We're so glad you enjoyed the cherry blossoms.",
        "date": "2024-04-03"
      }
    },
    {
      "id": 2,
      "user": {
        "name": "James Taylor",
        "location": "Auckland, New Zealand",
        "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
        "traveler_type": "Solo Traveler"
      },
      "rating": 4,
      "title": "Great tour, but busy",
      "review_text": "The tour was fantastic, but Tokyo was very crowded during cherry blossom season. Still, an amazing experience!",
      "date": "2024-04-10",
      "verified_booking": true,
      "photos": [],
      "helpful_count": 9,
      "response": {
        "text": "Thank you for your feedback, James! We'll work on managing the crowds better.",
        "date": "2024-04-12"
      }
    }
  ]
},
{
  "title": "Dubai Desert Safari: 4-Day Luxury Experience",
  "overview": "Experience Dubai’s contrasts: ascend the Burj Khalifa’s 124th-floor skydeck, race across golden dunes in 4x4s, and unwind at Atlantis The Palm’s Aquaventure Waterpark. Sleep in 5-star Downtown towers, dine under Bedouin tents with belly dancers, and shop for gold at the Deira Souk. Includes a private yacht tour of Palm Jumeirah, falconry displays, and a sunset camel ride followed by a starlit BBQ. Combines futuristic opulence with Arabian Desert traditions.",
  "destination": {
    "country": "UAE",
    "city": "Dubai",
    "map": "https://maps.google.com/?q=Dubai"
  },
  "food": {
  "description": "Indulge in Dubai's exquisite culinary fusion of traditional Emirati flavors and international cuisine. From lavish hotel breakfasts with Arabian coffee to sunset BBQs in the desert, our dining experiences blend luxury with authentic local tastes. Enjoy halal-certified meals throughout your journey, with options available for vegetarian, vegan, and gluten-free diets.",
  "meal_schedule": {
    "breakfast": {
      "time": "7:00 AM – 10:00 AM",
      "options": ["International buffet", "Arabic breakfast", "Vegetarian"]
    },
    "lunch": {
      "time": "12:30 PM – 3:00 PM",
      "options": ["Restaurant dining", "Poolside light meals", "Vegan"]
    },
    "dinner": {
      "time": "7:30 PM – 10:30 PM",
      "options": ["Desert BBQ feast", "Gourmet hotel dining", "Traditional Emirati"]
    }
  },
  "dining_experiences": [
    "Sunset desert BBQ with live entertainment",
    "Private yacht dinner cruise",
    "Traditional Arabic coffee and dates welcome"
  ]
},
  "country_history": "The United Arab Emirates (UAE), formed in 1971, is a federation of seven emirates, including Dubai and Abu Dhabi. Historically a region of small fishing and pearl-diving villages, the UAE transformed into a global hub of trade, tourism, and innovation following the discovery of oil in the 20th century. Dubai, in particular, has become synonymous with luxury, boasting iconic landmarks like the Burj Khalifa and Palm Jumeirah. The UAE blends modern architecture with deep-rooted traditions, making it a unique destination in the Middle East.",
  "duration": "4 Days, 3 Nights",
  "available_dates": [
    "2025-06-05",
    "2025-07-10",
    "2025-08-15"
  ],
  "price": {
    "currency": "USD",
    "per_person": 999,
    "group_discount": {
      "min_people": 3,
      "discount_percent": 8
    }
  },
  "banner_img": "https://i.ibb.co.com/5hXwqZh8/Premium-desert-safari-Dubai.jpg",
  "IMG1": "https://i.ibb.co.com/XrqpjMzC/Luxury-desert-safari-Dubai-VIP-desert-safari-optionsexclusive-desert-experience.jpg",
  "IMG2": "https://i.ibb.co.com/LDH1F3W5/images-1-1.jpg",
  "IMG3": "https://i.ibb.co.com/0R58vDLW/SC2.jpg",
  "IMG4": "https://i.ibb.co.com/pBJRTnQr/images-4.jpg",
  "IMG5": "https://i.ibb.co.com/XkxWBfJn/Luxury-safari-food-1024x683.jpg",
  "IMG6": "https://i.ibb.co.com/KzzXSk28/SC1.jpg",
  "itinerary": [
    {
      "day": 1,
      "title": "City Tour & Burj Khalifa",
      "description": "Arrive in Dubai and begin your journey with a luxurious transfer to your 5-star hotel overlooking the city skyline. After checking in, embark on a guided city tour, starting with the futuristic Dubai Marina, where yachts gleam against shimmering waters. Next, ascend to the observation deck of the Burj Khalifa, the world’s tallest building, for breathtaking views of the desert and sea. Conclude your day with a shopping spree at the Dubai Mall, followed by dinner at a rooftop restaurant with the Burj Al Arab in sight."
    },
    {
      "day": 2,
      "title": "Desert Safari & Bedouin Dinner",
      "description": "After breakfast, prepare for an exhilarating desert adventure. Travel by 4x4 to the golden dunes outside Dubai, where you’ll experience dune bashing with expert drivers. Try sandboarding down the slopes, then visit a Bedouin-style camp for a cultural evening. Enjoy camel rides, henna painting, and a falconry display, followed by a lavish BBQ dinner under the stars, complete with live belly dancing and traditional *tanoura* performances. Return to your hotel for a restful night."
    },
    {
      "day": 3,
      "title": "Palm Jumeirah & Atlantis Aquaventure",
      "description": "Today, explore the man-made marvel of Palm Jumeirah. After a leisurely breakfast, visit this palm-shaped island, home to luxury resorts and stunning beaches. Spend the day at Atlantis The Palm’s Aquaventure Waterpark, where you’ll thrill to water slides like the Leap of Faith, float along the lazy river, or relax on the private beach. Enjoy lunch at one of the resort’s world-class restaurants, then return to your hotel for an evening at leisure, perhaps indulging in a spa treatment."
    },
    {
      "day": 4,
      "title": "Departure",
      "description": "Savor your final morning in Dubai with breakfast at the hotel’s terrace, overlooking the city’s glittering skyline. Take some time to explore the nearby Souk Al Bahar for last-minute souvenirs or simply relax by the pool. Our team will arrange a seamless transfer to Dubai International Airport, ensuring you leave with unforgettable memories of desert thrills and urban luxury."
    }
  ],
  "inclusions": [
    "5-star hotel",
    "Breakfast & dinner",
    "Desert safari tour"
  ],
  "exclusions": [
    "Flights to/from Dubai",
    "Personal expenses"
  ],
  "accommodation": {
    "hotel_name": "Burj Al Arab Jumeirah",
    "rating": 5,
    "room_type": "Ocean Suite",
    "photos": [
      "https://i.ibb.co.com/wrC1tkjr/caption-1.jpg",
      "https://i.ibb.co.com/z1BDsBf/burj-al-arab-jacuzzi.jpg",
      "https://i.ibb.co.com/ymrCVZ8x/images-2-4.jpg",
      "https://i.ibb.co.com/4RzYYmSc/beautiful-lower-lobby.jpg",
      "https://i.ibb.co.com/gFHb6cMW/images-1-6.jpg",
      "https://i.ibb.co.com/p66tJ9Ys/5de8de09.jpg"
    ]
  },
  "reviews": [
    {
      "id": 1,
      "user": {
        "name": "Emma Wilson",
        "location": "Vancouver, Canada",
        "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
        "traveler_type": "Couple"
      },
      "rating": 5,
      "title": "Magical cherry blossom experience!",
      "review_text": "The cherry blossoms were breathtaking, and the cultural activities were so immersive. The tea ceremony was a highlight!",
      "date": "2024-04-01",
      "verified_booking": true,
      "photos": [
        "/reviews/tokyo-1.jpg"
      ],
      "helpful_count": 18,
      "response": {
        "text": "Thank you, Emma! We're so glad you enjoyed the cherry blossoms.",
        "date": "2024-04-03"
      }
    },
    {
      "id": 2,
      "user": {
        "name": "James Taylor",
        "location": "Auckland, New Zealand",
        "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
        "traveler_type": "Solo Traveler"
      },
      "rating": 4,
      "title": "Great tour, but busy",
      "review_text": "The tour was fantastic, but Tokyo was very crowded during cherry blossom season. Still, an amazing experience!",
      "date": "2024-04-10",
      "verified_booking": true,
      "photos": [],
      "helpful_count": 9,
      "response": {
        "text": "Thank you for your feedback, James! We'll work on managing the crowds better.",
        "date": "2024-04-12"
      }
    }
  ]
},

{
  "title": "Tokyo Cherry Blossom Tour: 5 Days of Cultural Beauty",
  "overview": "Stroll beneath pink sakura canopies in Ueno Park and Shinjuku Gyoen, savor kaiseki dinners, and master sushi-making with a Michelin chef. Day-trip to Mount Fuji’s 5th Station for blossom-framed vistas, explore Asakusa’s Senso-ji Temple, and dance through Harajuku’s neon-lit streets. Stay in a 4-star Ginza hotel, cruise the Sumida River at dusk, and witness ancient tea ceremonies. A springtime immersion into Japan’s harmony of tradition and pop culture.",
  "destination": {
    "country": "Japan",
    "city": "Tokyo",
    "map": "https://maps.google.com/?q=Tokyo"
  },
  "food": {
  "description": "Savor the delicate flavors of Japan during cherry blossom season with authentic kaiseki meals, fresh sushi, and seasonal sakura-themed treats. Our culinary journey highlights traditional Japanese dining etiquette and the art of presentation, with special attention to spring ingredients. Vegetarian, vegan, and halal options are available upon request.",
  "meal_schedule": {
    "breakfast": {
      "time": "7:00 AM – 9:30 AM",
      "options": ["Japanese traditional", "Western buffet", "Vegetarian"]
    },
    "lunch": {
      "time": "12:00 PM – 2:30 PM",
      "options": ["Bento box", "Sushi workshop", "Ramen specialty"]
    },
    "dinner": {
      "time": "6:30 PM – 9:30 PM",
      "options": ["Kaiseki dinner", "Izakaya experience", "Teppanyaki"]
    }
  },
  "dining_experiences": [
    "Sakura-themed afternoon tea with cherry blossom sweets",
    "Sushi-making class with a Michelin-trained chef",
    "Traditional tea ceremony with wagashi (Japanese confections)"
  ]
},
  "country_history": "Japan, an island nation in East Asia, has a history spanning thousands of years, from its ancient Jomon period to the rise of samurai culture and the modernization of the Meiji Restoration. Known for its unique blend of tradition and innovation, Japan has preserved its cultural heritage, including tea ceremonies, kimono, and cherry blossom festivals, while becoming a global leader in technology and industry. Tokyo, its capital, is a bustling metropolis that reflects Japan’s dynamic past and future, offering a mix of historic temples and futuristic skyscrapers.",
  "duration": "5 Days, 4 Nights",
  "available_dates": [
    "2025-03-25",
    "2025-04-05",
    "2025-04-15"
  ],
  "price": {
    "currency": "USD",
    "per_person": 1200,
    "group_discount": {
      "min_people": 4,
      "discount_percent": 10
    }
  },
  "banner_img": "https://i.ibb.co.com/0p36JwGJ/the-sakura-of-japan-are-well-known-around-the-world-for-their-radiant-delicate-and-transient-beauty.jpg",
  "IMG1": "https://i.ibb.co.com/nMMjyKGN/a0001033-parts-5fd03fc9e4ff4.jpg",
  "IMG2": "https://i.ibb.co.com/2YMSK8Tw/images-5.jpg",
  "IMG3": "https://i.ibb.co.com/wZvpgJZk/1-shutterstock-1471614707-480x480.jpg",
  "IMG4": "https://i.ibb.co.com/s9fBLmcw/Tokyo-Cherry-Blossoms1-SH.jpg",
  "IMG5": "https://i.ibb.co.com/qMybv1Kv/images-2-1.jpg",
  "IMG6": "https://i.ibb.co.com/ym3jkB23/images-4-1.jpg",
  "itinerary": [
    {
      "day": 1,
      "title": "Cherry Blossom Viewing",
      "description": "Arrive at Narita International Airport, where our team will greet you with a warm welcome. Transfer to your 4-star hotel in central Tokyo, perfectly located for your cherry blossom adventure. After checking in, head to Ueno Park, one of Tokyo’s most famous *sakura* spots, where thousands of cherry trees bloom in a pink spectacle. Stroll along the pathways, enjoy a picnic lunch under the blossoms, and visit Shinjuku Gyoen for more serene gardens. End your day with a traditional *kaiseki* dinner."
    },
    {
      "day": 2,
      "title": "Asakusa & Senso-ji Temple",
      "description": "After breakfast, dive into Tokyo’s rich history with a visit to Asakusa. Explore Senso-ji, Tokyo’s oldest temple, where you’ll pass through the iconic Kaminarimon Gate and wander Nakamise Street, lined with shops selling traditional crafts and snacks like *ningyo-yaki*. Learn about Buddhist rituals from your guide and enjoy a sushi lunch at a local eatery. In the afternoon, take a scenic Sumida River cruise to see cherry blossoms from the water, ending with a view of Tokyo Skytree at dusk."
    },
    {
      "day": 3,
      "title": "Mount Fuji Day Trip",
      "description": "Embark on a full-day excursion to Mount Fuji, Japan’s sacred peak. After an early breakfast, travel by coach to the 5th Station (weather permitting), offering stunning views of the snow-capped mountain framed by cherry blossoms in spring. Visit Lake Kawaguchi, where you’ll enjoy a boat ride with Fuji as your backdrop, followed by lunch featuring *hoto* noodles, a local specialty. Stop at Chureito Pagoda for an iconic photo before returning to Tokyo for a relaxing evening."
    },
    {
      "day": 4,
      "title": "Harajuku & Shibuya",
      "description": "Today, explore Tokyo’s vibrant modern culture. Start in Harajuku with a walk down Takeshita Street, famous for its quirky fashion boutiques and colorful street food like *crepes* and *cotton candy*. Visit Meiji Shrine, a tranquil oasis amid the city, and enjoy a traditional tea ceremony. After lunch, head to Shibuya to cross the world-famous Scramble Crossing and see the Hachiko statue. Spend your evening shopping or dining in this bustling district, soaking in Tokyo’s electric energy."
    },
    {
      "day": 5,
      "title": "Departure",
      "description": "Enjoy a final breakfast at your hotel, perhaps sampling Japanese staples like miso soup and grilled fish. Take some time to explore nearby Ginza for luxury shopping or simply relax with a view of the city skyline. Our team will arrange your transfer back to Narita Airport, ensuring a smooth departure as you leave with memories of Japan’s cherry blossoms and cultural wonders."
    }
  ],
  "inclusions": [
    "4-star hotel",
    "Breakfast & dinner",
    "Temple tours"
  ],
  "exclusions": [
    "Flights to/from Japan",
    "Rail pass"
  ],
  "reviews": [
    {
      "id": 1,
      "user": {
        "name": "Emma Wilson",
        "location": "Vancouver, Canada",
        "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
        "traveler_type": "Couple"
      },
      "rating": 5,
      "title": "Magical cherry blossom experience!",
      "review_text": "The cherry blossoms were breathtaking, and the cultural activities were so immersive. The tea ceremony was a highlight!",
      "date": "2024-04-01",
      "verified_booking": true,
      "photos": [
        "/reviews/tokyo-1.jpg"
      ],
      "helpful_count": 18,
      "response": {
        "text": "Thank you, Emma! We're so glad you enjoyed the cherry blossoms.",
        "date": "2024-04-03"
      }
    },
    {
      "id": 2,
      "user": {
        "name": "James Taylor",
        "location": "Auckland, New Zealand",
        "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
        "traveler_type": "Solo Traveler"
      },
      "rating": 4,
      "title": "Great tour, but busy",
      "review_text": "The tour was fantastic, but Tokyo was very crowded during cherry blossom season. Still, an amazing experience!",
      "date": "2024-04-10",
      "verified_booking": true,
      "photos": [],
      "helpful_count": 9,
      "response": {
        "text": "Thank you for your feedback, James! We'll work on managing the crowds better.",
        "date": "2024-04-12"
      }
    }
  ],
  "accommodation": {
    "hotel_name": "4-Star Ginza Hotel",
    "rating": 4,
    "room_type": "Standard Room",
    "photos": [
      "https://i.ibb.co.com/tw5ykfhJ/images-6.jpg",
      "https://i.ibb.co.com/spRP4QMS/images-3-3.jpg",
      "https://i.ibb.co.com/QjxtFysg/649498515.jpg",
      "https://i.ibb.co.com/kgKYw4Vj/images-7.jpg",
      "https://i.ibb.co.com/zhbGS0bt/xxl-153163577.jpg",
      "https://i.ibb.co.com/Z6rPxZ4f/509703320.jpg"
    ]
  }
}
,
{
  "title": "Santorini Romance: 5-Day Luxury Escape",
  "overview": "Revel in Caldera View Suites’ infinity pools, private yacht cruises at sunset, and candlelit dinners in Oia’s cliffside caves. Explore Akrotiri’s volcanic ruins, snorkel the Aegean’s crystal coves, and taste Assyrtiko wines at Santorini’s oldest vineyard. Includes a guided walk through Fira’s blue-domed alleys, therapeutic hot spring dips, and a photoshoot at Red Beach’s crimson cliffs. Tailored for honeymooners and romantics chasing whitewashed perfection.",
  "destination": {
    "country": "Greece",
    "city": "Santorini",
    "map": "https://maps.google.com/?q=Santorini"
  },
  "food": {
  "description": "Indulge in Santorini's world-renowned gastronomy, where volcanic soil produces unique flavors. Enjoy sunset seafood dinners, traditional Greek meze platters, and private vineyard tastings. Our culinary experiences highlight fresh local ingredients like cherry tomatoes, fava beans, and white eggplant, paired with exceptional Assyrtiko wines. Vegetarian, vegan and gluten-free options are available.",
  "meal_schedule": {
    "breakfast": {
      "time": "8:00 AM – 10:30 AM",
      "options": ["Greek yogurt with honey", "Mediterranean buffet", "Fresh fruit & pastries"]
    },
    "lunch": {
      "time": "1:00 PM – 3:00 PM",
      "options": ["Seaside taverna dining", "Picnic with caldera views", "Light salads & sandwiches"]
    },
    "dinner": {
      "time": "7:30 PM – 10:00 PM",
      "options": ["Candlelit cliffside dining", "Private chef experience", "Traditional Greek feast"]
    }
  },
  "dining_experiences": [
    "Sunset seafood dinner in an Oia cave restaurant",
    "Private wine pairing dinner at a cliffside vineyard",
    "Greek cooking class featuring Santorini specialties"
  ]
  },
  "country_history": "Greece, the cradle of Western civilization, has a history spanning over 3,000 years, from the ancient Minoan and Mycenaean civilizations to the Golden Age of Athens and the Hellenistic period. Known for its contributions to philosophy, democracy, and the arts, Greece is also famous for its mythology and archaeological sites like the Acropolis and Delphi. Santorini, part of the Cyclades islands, is renowned for its stunning sunsets, whitewashed buildings, and volcanic landscapes, offering a glimpse into Greece’s ancient and modern allure.",
  "duration": "5 Days, 4 Nights",
  "available_dates": [
    "2025-07-01",
    "2025-08-10",
    "2025-09-05"
  ],
  "price": {
    "currency": "USD",
    "per_person": 1499,
    "group_discount": {
      "min_people": 3,
      "discount_percent": 15
    }
  },
  "banner_img": "https://i.ibb.co.com/yFG1HJps/Santorini-2024-Street-View-Shutterstock-1040803156-Hybris.jpg",
  "IMG1": "https://i.ibb.co.com/RpD2H5bJ/oia-santorini-greece.jpg",
  "IMG2": "https://i.ibb.co.com/1tBtGk34/caption.jpg",
  "IMG3": "https://i.ibb.co.com/4nCRw3W7/a3.jpg",
  "IMG4": "https://i.ibb.co.com/BpgZ11F/images-6.jpg",
  "IMG5": "https://i.ibb.co.com/kscf97jx/images-1-2.jpg",
  "IMG6": "https://i.ibb.co.com/S4hRCMJX/Santorini-2024-Street-View-Shutterstock-1040803156-Hybris.jpg",
  "itinerary": [
    {
      "day": 1,
      "title": "Arrival & Sunset Cruise",
      "description": "Your romantic getaway begins as you arrive at Santorini Airport, greeted by our team with a warm smile and a chilled glass of local Assyrtiko wine. Transfer to your luxury hotel perched on the caldera cliffs, offering uninterrupted sea views from your Sea View Suite. After settling in, embark on a sunset cruise aboard a traditional wooden boat. Sail past volcanic islands, sip champagne, and watch the sky blaze with color as the sun dips below the horizon—a perfect start to your Santorini escape."
    },
    {
      "day": 2,
      "title": "Oia Village & Akrotiri",
      "description": "After a breakfast of Greek yogurt and honey on your private terrace, set out to explore Oia, Santorini’s most picturesque village. Wander through narrow cobblestone streets lined with whitewashed houses and blue-domed churches, stopping for photos at every turn. Enjoy a leisurely lunch at a cliffside taverna, tasting *fava* and fresh seafood. In the afternoon, visit the ancient ruins of Akrotiri, a Minoan city preserved by volcanic ash, and learn about its fascinating history from your guide."
    },
    {
      "day": 3,
      "title": "Red Beach & Wine Tasting",
      "description": "Today, discover Santorini’s unique beaches and flavors. After breakfast, head to Red Beach, famous for its striking red volcanic sand and turquoise waters. Swim, sunbathe, or simply relax under an umbrella with a good book. In the afternoon, visit a local winery for a tasting session, sampling crisp whites and robust reds paired with cheeses and olives. Learn about Santorini’s volcanic soil and its impact on viticulture, then return to your hotel for a quiet evening."
    },
    {
      "day": 4,
      "title": "Fira & Hot Springs",
      "description": "Explore Fira, Santorini’s lively capital, after a leisurely breakfast. Stroll through its bustling streets, browsing boutiques and art galleries, and visit the Museum of Prehistoric Thera to see artifacts from Akrotiri. Then, take a boat to the volcanic Nea Kameni island, where you’ll swim in therapeutic hot springs warmed by the caldera. Enjoy a seafood lunch on the boat before returning to Fira for a romantic dinner with caldera views, featuring *moussaka* and baklava."
    },
    {
      "day": 5,
      "title": "Departure",
      "description": "Spend your final morning in Santorini with breakfast overlooking the Aegean Sea. Take a last walk along the caldera or relax by the pool with a cocktail in hand. Our team will handle your checkout and provide a private transfer to the airport, ensuring a smooth farewell. Leave with memories of Santorini’s romance and beauty etched in your heart."
    }
  ],
  "inclusions": [
    "Luxury hotel accommodation",
    "Daily breakfast & 2 dinners",
    "Sunset cruise",
    "Guided village tour"
  ],
  "exclusions": [
    "Flights to/from Santorini",
    "Personal expenses"
  ],
  "accommodation": {
    "hotel_name": "Caldera View Suites",
    "rating": 5,
    "room_type": "Sea View Suite",
    "photos": [
      "https://i.ibb.co.com/4gwnz1d7/69fd9d48.jpg",
      "https://i.ibb.co.com/wFJDhvg6/images-9.jpg",
      "https://i.ibb.co.com/0vbvG01/images-10.jpg",
      "https://i.ibb.co.com/DHvfgQwv/images-11.jpg",
      "https://i.ibb.co.com/VWwPJ6LP/images-13.jpg",
      "https://i.ibb.co.com/m5b6v2W8/images-14.jpg"
    ]
  },
  "reviews": [
    {
      "id": 1,
      "user": {
        "name": "Emma Wilson",
        "location": "Vancouver, Canada",
        "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
        "traveler_type": "Couple"
      },
      "rating": 5,
      "title": "Magical cherry blossom experience!",
      "review_text": "The cherry blossoms were breathtaking, and the cultural activities were so immersive. The tea ceremony was a highlight!",
      "date": "2024-04-01",
      "verified_booking": true,
      "photos": [
        "/reviews/tokyo-1.jpg"
      ],
      "helpful_count": 18,
      "response": {
        "text": "Thank you, Emma! We're so glad you enjoyed the cherry blossoms.",
        "date": "2024-04-03"
      }
    },
    {
      "id": 2,
      "user": {
        "name": "James Taylor",
        "location": "Auckland, New Zealand",
        "avatar": "https://i.ibb.co.com/Y75TTn5p/man-working-laptop-from-office-1108340-892.jpg",
        "traveler_type": "Solo Traveler"
      },
      "rating": 4,
      "title": "Great tour, but busy",
      "review_text": "The tour was fantastic, but Tokyo was very crowded during cherry blossom season. Still, an amazing experience!",
      "date": "2024-04-10",
      "verified_booking": true,
      "photos": [],
      "helpful_count": 9,
      "response": {
        "text": "Thank you for your feedback, James! We'll work on managing the crowds better.",
        "date": "2024-04-12"
      }
    }
  ]
}
,
  {
    "title": "New York City Adventure: 6-Day Urban Exploration",
    "overview": "Live like Manhattan royalty: front-row Broadway tickets, helicopter flights over the Statue of Liberty, and 5-star suites near Times Square. Kayak Central Park’s lakes, explore the Met’s art vaults, and dine at Michelin-starred eateries. Walk the Brooklyn Bridge at golden hour, shop Fifth Avenue’s flagship boutiques, and toast with rooftop cocktails overlooking the Empire State Building. The ultimate blend of iconic landmarks, hidden gems, and cosmopolitan luxury.",
    "destination": {
      "country": "USA",
      "city": "New York",
      "map": "https://maps.google.com/?q=New+York"
    },
    "food": {
  "description": "Experience the culinary capital of the world where every meal is a passport to global flavors. Savor NYC’s diverse food scene with everything from iconic street food to high-end gourmet experiences. Indulge in New York-style bagels and lox for breakfast, food truck tacos in SoHo for lunch, and Michelin-starred tasting menus for dinner. Options span Italian trattorias in Little Italy, dim sum in Chinatown, and plant-based delicacies in Williamsburg. Kosher, halal, vegan, vegetarian, and gluten-free meals are available.",
  "meal_schedule": {
    "breakfast": {
      "time": "7:00 AM – 10:00 AM",
      "options": ["Bagels with cream cheese & smoked salmon", "Continental buffet", "Fresh fruit & artisan pastries"]
    },
    "lunch": {
      "time": "12:30 PM – 2:30 PM",
      "options": ["Gourmet food truck fare", "Central Park picnic", "Trendy café bites"]
    },
    "dinner": {
      "time": "7:00 PM – 10:00 PM",
      "options": ["Michelin-starred dining", "Brooklyn rooftop BBQ", "Italian feast in Little Italy"]
    }
  },
  "dining_experiences": [
    "Private dinner with a skyline view at a Manhattan rooftop restaurant",
    "Food tour through Chinatown and Little Italy",
    "Interactive cooking class with a celebrity chef"
  ]
}
,
    "country_history": "The United States of America, founded in 1776, is a nation built on ideals of freedom and democracy. New York City, its largest metropolis, has been a gateway for immigrants and a center of culture, finance, and innovation. From its early days as a Dutch colony to its rise as a global powerhouse, NYC has shaped American history. Iconic landmarks like the Statue of Liberty, Central Park, and Times Square reflect its diverse heritage and dynamic spirit, making it a symbol of opportunity and ambition.",
    "duration": "6 Days, 5 Nights",
    "available_dates": [
      "2025-06-01",
      "2025-07-01",
      "2025-08-01"
    ],
    "price": {
      "currency": "USD",
      "per_person": 2299,
      "group_discount": {
        "min_people": 5,
        "discount_percent": 10
      }
    },
    "banner_img": "https://i.ibb.co.com/HpRhVdd1/cfimages.jpg",
    "IMG1":"https://i.ibb.co.com/nMVJVmzz/Brooklyn-Bridge-at-sunset.jpg",
    "IMG2": "https://i.ibb.co.com/bj4TNtpt/images-1-3.jpg",
    "IMG3": "https://i.ibb.co.com/wnVXWht/TI-Boldt-Castle-Fall-NYSDED-F473-C945-034-A-A741-118-F4-E10-A2-E72844-f473c8030d560f2-f473c99c-9695.jpg",
    "IMG4": "https://i.ibb.co.com/2wkTYNH/NYC-Must-See-Attractions-f.jpg",
    "IMG5": "https://i.ibb.co.com/rG535pFf/resized-image-promo-2023-08-10t152647-540.jpg",
    "IMG6": "https://i.ibb.co.com/27v4FL2r/pexels-arthurbrognoli-2260833.jpg",
    "itinerary": [
      {
        "day": 1,
        "title": "Arrival & Times Square",
        "description": "Your New York adventure begins as you arrive at JFK Airport, where our team will whisk you to your 5-star hotel in the heart of Manhattan. After checking into your Luxury Suite, step out to explore the electric energy of Times Square. Marvel at the towering billboards, street performers, and bustling crowds. Enjoy a welcome dinner at a classic New York diner, savoring a juicy burger or a slice of pizza, with the city’s lights as your backdrop."
      },
      {
        "day": 2,
        "title": "Central Park & Broadway Show",
        "description": "After breakfast, head to Central Park for a guided tour of this urban oasis. Stroll through Strawberry Fields, visit Bethesda Terrace, and rent a rowboat on the lake if you’re feeling adventurous. Enjoy a picnic lunch amidst the greenery, then return to the hotel to freshen up. In the evening, experience the magic of Broadway with premium tickets to a hit show—think *The Lion King* or *Hamilton*—followed by a late-night snack at a nearby deli."
      },
      {
        "day": 3,
        "title": "Statue of Liberty & Ellis Island",
        "description": "Today, explore New York’s historic roots. After breakfast, take a ferry to the Statue of Liberty, where you’ll climb to the pedestal (or crown, if you’re up for it) for stunning harbor views. Continue to Ellis Island, delving into the stories of millions of immigrants who passed through its halls. Enjoy a waterfront lunch at Battery Park, then spend the afternoon wandering the Financial District, including a stop at the 9/11 Memorial. Return to your hotel for a relaxing evening."
      },
      {
        "day": 4,
        "title": "Museum Mile & Fifth Avenue",
        "description": "Immerse yourself in art and culture along Museum Mile. After breakfast, visit the Metropolitan Museum of Art, where you’ll explore centuries of masterpieces from ancient Egypt to modern America. Enjoy lunch at a chic café, then stroll down Fifth Avenue, window-shopping at flagship stores like Tiffany’s and Saks. Stop by Rockefeller Center to see the famous skating rink (or Atlas statue in summer) before returning to your hotel for dinner at leisure."
      },
      {
        "day": 5,
        "title": "Brooklyn & Helicopter Ride",
        "description": "Cross the East River to Brooklyn after breakfast. Walk the Brooklyn Bridge for iconic skyline views, then explore Dumbo’s trendy streets and the Brooklyn Museum. Enjoy a classic New York bagel brunch before your highlight: a thrilling helicopter ride over Manhattan, offering aerial views of the Empire State Building, Central Park, and more. Spend your evening in the vibrant East Village, dining at a local hotspot with live music."
      },
      {
        "day": 6,
        "title": "Departure",
        "description": "Enjoy a final breakfast at your hotel, perhaps indulging in a stack of pancakes with New York maple syrup. Take some time to explore nearby Bryant Park or pick up souvenirs at Grand Central Terminal. Our team will arrange your transfer back to JFK Airport, ensuring a smooth departure as you leave with memories of the city that never sleeps."
      }
    ],
    "inclusions": [
      "5-star hotel accommodation",
      "Daily breakfast & 1 dinner",
      "Broadway tickets",
      "Central Park guided tour"
    ],
    "exclusions": [
      "Flights to/from New York",
      "Personal expenses"
    ],
    "accommodation": {
      "hotel_name": "Times Square Grand Hotel",
      "rating": 4.5,
      "room_type": "Luxury Suite",
      "photos": [
        "https://i.ibb.co.com/4nkY90GY/images-3.jpg",
        "https://i.ibb.co.com/6RbVMTnb/images-1.jpg",
        "https://i.ibb.co.com/RTTywW81/b380c4a9.jpg",
        "https://i.ibb.co.com/1twwtbCh/images.jpg",
        "https://i.ibb.co.com/jkn8pykq/expedia-group-87347-86817e-523913.jpg",
        "https://i.ibb.co.com/Kxm2WZBy/images-4.jpg"
       
      ]
        
    },
    "reviews": [
      {
        "id": 1,
        "user": {
          "name": "Emma Wilson",
          "location": "Vancouver, Canada",
          "avatar": "https://i.ibb.co.com/Xr3WYD0X/images-1.jpg",
          "traveler_type": "Couple"
        },
        "rating": 5,
        "title": "Magical cherry blossom experience!",
        "review_text": "The cherry blossoms were breathtaking, and the cultural activities were so immersive. The tea ceremony was a highlight!",
        "date": "2024-04-01",
        "verified_booking": true,
        "photos": [
          "/reviews/tokyo-1.jpg"
        ],
        "helpful_count": 18,
        "response": {
          "text": "Thank you, Emma! We're so glad you enjoyed the cherry blossoms.",
          "date": "2024-04-03"
        }
      },
      {
        "id": 2,
        "user": {
          "name": "James Taylor",
          "location": "Auckland, New Zealand",
          "avatar": "https://i.ibb.co.com/p6rZqfCQ/360-F-214746128-31-Jkea-P6r-U0-Nzzzd-FC4kh-Gkmqc8noe6h.jpg",
          "traveler_type": "Solo Traveler"
        },
        "rating": 4,
        "title": "Great tour, but busy",
        "review_text": "The tour was fantastic, but Tokyo was very crowded during cherry blossom season. Still, an amazing experience!",
        "date": "2024-04-10",
        "verified_booking": true,
        "photos": [],
        "helpful_count": 9,
        "response": {
          "text": "Thank you for your feedback, James! We'll work on managing the crowds better.",
          "date": "2024-04-12"
        }
      }
    ]
   
  },
  {
    "title": "Machu Picchu Expedition: 7-Day Trekking Tour",
    "overview": "Trek the Inca Trail’s ancient paths to Machu Picchu’s Sun Gate, camp under Andean stars, and explore Cusco’s colonial plazas. Conquer Dead Woman’s Pass (4,215m), feast on lomo saltado in Sacred Valley lodges, and meet Quechua weavers in Ollantaytambo. Includes luxury mountain-view suites, guided tours of Qorikancha Temple, and a scenic Vistadome train ride. For adventurers craving archaeological wonders and Andean culture.",
    "destination": {
      "country": "Peru",
      "city": "Cusco",
      "map": "https://maps.google.com/?q=Cusco"
    },
    "duration": "7 Days, 6 Nights",
    "available_dates": [
      "2025-04-05",
      "2025-05-15",
      "2025-06-20"
    ],
    "price": {
      "currency": "USD",
      "per_person": 1599,
      "group_discount": {
        "min_people": 6,
        "discount_percent": 12
      }
    },
    "food": {
      "description": "Peruvian cuisine is a celebration of ancient ingredients and culinary innovation. On this journey, you’ll enjoy hearty Andean meals prepared by local chefs—perfectly balanced for high-altitude trekking. From coca tea mornings to gourmet dinners in Sacred Valley lodges, every dish is infused with cultural richness. Savor ceviche fresh from the Pacific coast, quinoa soups, grilled trout from Urubamba, and the famous lomo saltado. Vegetarian and gluten-free options are always available, and meals are thoughtfully prepared to fuel your adventure.",
      "meal_schedule": {
        "breakfast": {
          "time": "6:30 AM – 8:00 AM",
          "options": ["Coca tea & fresh fruit", "Andean pancakes", "Scrambled eggs with quinoa toast"]
        },
        "lunch": {
          "time": "12:00 PM – 1:30 PM",
          "options": ["Boxed lunch during treks", "Traditional pachamanca (earth oven meal)", "Lentil stew with native potatoes"]
        },
        "dinner": {
          "time": "6:30 PM – 8:30 PM",
          "options": ["Lomo saltado with rice", "Grilled trout with Andean herbs", "Vegetarian tamales"]
        }
      },
      "dining_experiences": [
        "Dinner under the stars at a remote Inca campsite",
        "Cooking demonstration by a Sacred Valley lodge chef",
        "Market-to-table meal prepared with local Quechua ingredients"
      ]
    },
    "banner_img": "https://i.ibb.co.com/LzDL278Q/2700-2048.webp",
    "IMG1":"https://i.ibb.co.com/kVb7sbJD/istockphoto-588223086-612x612.jpg",
    "IMG2": "https://i.ibb.co.com/f3M5Y8c/A8560-The-7-wonders-of-the-World-how-theyre-built-Image-6.webp",
    "IMG3": "https://i.ibb.co.com/p6ytsVX7/images-2.jpg",
    "IMG4": "https://i.ibb.co.com/mVTTkDm9/scott-umstattd-87129-2470x1647.jpg",
    "IMG5": "https://i.ibb.co.com/ZpdFH13Z/images-5.jpg",
    "IMG6": "https://i.ibb.co.com/HTwpxbk7/images-3.jpg",
    "itinerary": [
      {
        "day": 1,
        "title": "Arrival in Cusco",
        "description": "Your journey begins as you arrive in Cusco, the historic heart of the Inca Empire. Our team will meet you at Alejandro Velasco Astete Airport and transfer you to your hotel, a charming lodge with mountain views. Spend the day acclimating to the 3,400-meter altitude with a gentle city tour, visiting the Plaza de Armas, Cusco Cathedral, and Qorikancha, the Temple of the Sun. Enjoy a welcome dinner of Andean cuisine, featuring *cuy* (guinea pig) or *lomo saltado*, paired with coca tea."
      },
      {
        "day": 2,
        "title": "Sacred Valley & Ollantaytambo",
        "description": "After breakfast, journey into the Sacred Valley of the Incas, a fertile region framed by towering peaks. Visit Pisac’s vibrant market, where you’ll browse colorful textiles and sample local fruits like *chirimoya*. Continue to Ollantaytambo, an Inca fortress with massive stone terraces, and explore its archaeological wonders with your guide. Enjoy a traditional lunch at a local hacienda, then spend the night in a Sacred Valley lodge, preparing for your trek ahead."
      },
      {
        "day": 3,
        "title": "Inca Trail Day 1: Start of the Trek",
        "description": "Begin your Inca Trail adventure after an early breakfast. Travel by bus to Km 82, the trailhead, where you’ll meet your porters and start trekking through rolling hills and Andean villages. Pass the ruins of Llactapata, an ancient Inca site, and enjoy a boxed lunch with valley views. Reach your first campsite at Wayllabamba (3,000m) by late afternoon, where you’ll dine under the stars and rest in comfortable tents."
      },
      {
        "day": 4,
        "title": "Inca Trail Day 2: Dead Woman’s Pass",
        "description": "Today is the most challenging day of the trek. After a hearty breakfast, ascend to Warmiwañusca, or Dead Woman’s Pass, the highest point at 4,215 meters. The climb is steep but rewarding, with stunning views of snow-capped peaks and lush valleys. Enjoy a well-earned lunch at the summit, then descend to Pacaymayo (3,600m) for your campsite. Relax with a warm dinner as your guide shares Inca legends by the campfire."
      },
      {
        "day": 5,
        "title": "Inca Trail Day 3: Runkurakay & Sayacmarca",
        "description": "Wake to the sound of birds and a hot breakfast before continuing your trek. Climb to Runkurakay Pass (3,970m), visiting the circular ruins of Runkurakay along the way. Descend through cloud forests to Sayacmarca, a beautifully preserved Inca site perched on a cliff. Enjoy a picnic lunch with panoramic views, then trek to Phuyupatamarca (3,600m), known as the ‘Town Above the Clouds.’ Camp here, marveling at the sunset over the Andes."
      },
      {
        "day": 6,
        "title": "Inca Trail Day 4: Machu Picchu",
        "description": "Rise early for the final leg of your trek. After breakfast, descend through the Sun Gate (Inti Punku) to witness your first breathtaking view of Machu Picchu at sunrise. Explore this UNESCO World Heritage site with your guide, visiting the Temple of the Sun, Intihuatana stone, and Room of the Three Windows. After a detailed tour, take the train to Aguas Calientes for a celebratory dinner and a night in a comfortable hotel."
      },
      {
        "day": 7,
        "title": "Departure",
        "description": "Enjoy a leisurely breakfast in Aguas Calientes, with time to explore the local market for handmade crafts. Board the scenic train back to Cusco, reflecting on your incredible journey through the Andes. Our team will transfer you to the airport, ensuring a smooth departure as you leave with memories of Machu Picchu’s ancient wonders."
      }
    ],
    "inclusions": [
      "Guided trekking tour",
      "Luxury hotel stays",
      "Meals during the trek",
      "Train tickets to Aguas Calientes"
    ],
    "exclusions": [
      "Flights to/from Peru",
      "Personal expenses",
      "Machu Picchu entrance fee"
    ],
    "accommodation": {
      "hotel_name": "Sacred Valley Lodge",
      "rating": 4.8,
      "room_type": "Mountain View Suite",
      "photos": [
        "https://i.ibb.co.com/YTTrLz4s/614311495.jpg",
        "https://i.ibb.co.com/fGdb9SkD/614308793.jpg",
        "https://i.ibb.co.com/LFPgZyh/images-5-3.jpg",
        "https://i.ibb.co.com/VcSwSmXn/skylodge-adventure-suites.jpg",
        "https://i.ibb.co.com/YTKLRGVh/images-7-1.jpg",
        "https://i.ibb.co.com/tMXkd2YL/images-6-1.jpg"
      ]
    },
    "reviews": [
      {
        "id": 1,
        "user": {
          "name": "Liam Smith",
          "location": "Manchester, UK",
          "avatar": "https://i.ibb.co.com/rKjtjjKC/images.jpg",
          "traveler_type": "Couple"
        },
        "rating": 5,
        "title": "Unforgettable experience!",
        "review_text": "The desert safari was the highlight of our trip. The dune bashing was thrilling, and the Bedouin dinner under the stars was magical. Highly recommend this tour!",
        "date": "2024-05-10",
        "verified_booking": true,
        "photos": [
          "/reviews/dubai-1.jpg"
        ],
        "helpful_count": 20,
        "response": {
          "text": "Thank you, Liam! We're thrilled you enjoyed the desert safari.",
          "date": "2024-05-12"
        }
      },
      {
        "id": 2,
        "user": {
          "name": "Sophia Brown",
          "location": "Melbourne, Australia",
          "avatar": "https://i.ibb.co.com/BHQtcbWm/young-brazilian-man-isolated-on-260nw-2242569333.webp",
          "traveler_type": "Solo Traveler"
        },
        "rating": 4,
        "title": "Great tour, but crowded",
        "review_text": "The tour was fantastic, but some activities felt overcrowded. The Burj Khalifa visit was amazing, though!",
        "date": "2024-06-15",
        "verified_booking": true,
        "photos": [],
        "helpful_count": 10,
        "response": {
          "text": "Thank you for your feedback, Sophia! We'll work on managing crowd sizes better.",
          "date": "2024-06-17"
        }
      }
    ]
  },
  {
    "title": "Sydney & Great Barrier Reef Adventure: 7-Day Oceanic Expedition",
    "overview": "Snorkel the Great Barrier Reef’s coral gardens, climb Sydney Harbour Bridge, and unwind at Bondi Beach’s surf clubs. Sleep in Harbour View Suites, trek Blue Mountains’ eucalyptus trails, and cruise the Daintree River to spot crocodiles. Includes a VIP Opera House backstage tour, rainforest canopy walks, and a seafood feast at Cairns’ Night Markets. Combines urban sophistication with Australia’s wild coastal beauty.",
    "destination": {
      "country": "Australia",
      "city": "Sydney",
      "map": "https://maps.google.com/?q=Sydney"
    },
    "duration": "7 Days, 6 Nights",
    "available_dates": [
      "2025-09-01",
      "2025-10-10",
      "2025-11-15"
    ],
    "price": {
      "currency": "USD",
      "per_person": 2399,
      "group_discount": {
        "min_people": 4,
        "discount_percent": 10
      }
    },
    "food": {
      "description": "Australian cuisine is a vibrant fusion of fresh coastal seafood, multicultural influences, and native bush ingredients. This journey showcases Sydney's cosmopolitan dining scene and tropical Queensland flavors. Enjoy breakfasts with harbor views, seafood platters featuring Moreton Bay bugs, and authentic Aussie barbecue. Taste indigenous ingredients like lemon myrtle, wattleseed, and finger limes, with expert pairing of Australian wines and craft beers. Dietary requirements are catered for with advance notice.",
      "meal_schedule": {
        "breakfast": {
          "time": "7:00 AM – 9:00 AM",
          "options": ["Aussie big brekkie with eggs & avocado", "Vegemite toast with tropical fruit", "Pancakes with macadamia butter"]
        },
        "lunch": {
          "time": "12:00 PM – 2:00 PM",
          "options": ["Fish and chips by Bondi Beach", "Gourmet picnic in Blue Mountains", "Reef-side seafood buffet on cruise"]
        },
        "dinner": {
          "time": "6:30 PM – 9:00 PM",
          "options": ["Barramundi with bush spices", "Grass-fed beef steak", "Vegetarian pumpkin and wattleseed risotto"]
        }
      },
      "dining_experiences": [
        "Sunset seafood platter at Sydney Harbour",
        "Bush tucker tasting with Aboriginal guide",
        "Great Barrier Reef lunch on catamaran deck"
      ]
    },
    "banner_img": "https://i.ibb.co.com/NzTYhjx/istockphoto-1472330375-612x612.jpg",
    "IMG1":"https://i.ibb.co.com/B5Fxf3bD/great-barrier-reef-xl.jpg",
    "IMG2": "https://i.ibb.co.com/vxvKpXPF/images-1.jpg",
    "IMG3": "https://i.ibb.co.com/Fksgpc59/find-the-best-great-barrier-reef-tours-scaled.jpg",
    "IMG4": "https://i.ibb.co.com/T6Lwq5j/vlcsnap-2025-01-22-15h49m22s511-png.jpg",
    "IMG5": "https://i.ibb.co.com/whk5kBB3/Scuba-diver-sea-fan-coast-Australia-Great.webp",
    "IMG6": "https://i.ibb.co.com/yFRPCCVm/0-U6-FN33-Vaz-I4o6-450x300.jpg",
    "itinerary": [
      {
        "day": 1,
        "title": "Arrival & Sydney Opera House",
        "description": "Your Australian adventure begins as you touch down at Sydney Kingsford Smith Airport. Our team will transfer you to your luxurious hotel overlooking Sydney Harbour, where you’ll check into your Harbour View Suite. After settling in, embark on a guided tour of the Sydney Opera House, exploring its iconic sails and learning about its architectural marvels. Relax at Circular Quay with a waterfront dinner featuring fresh oysters and Aussie wines, watching ferries glide by."
      },
      {
        "day": 2,
        "title": "Bondi Beach & Coastal Walk",
        "description": "After breakfast, head to Bondi Beach, Sydney’s most famous stretch of sand. Spend the morning swimming, surfing, or simply soaking up the sun, with lifeguards ensuring your safety. Enjoy a beachside lunch at a local café, tasting fish and chips or a vegemite toastie. Then, take the scenic Bondi to Coogee coastal walk, a 6km trail offering stunning ocean views, hidden coves, and photo stops at Bronte and Tamarama beaches. Return to your hotel for a relaxing evening."
      },
      {
        "day": 3,
        "title": "Blue Mountains Day Trip",
        "description": "Escape the city for a day in the Blue Mountains, a UNESCO World Heritage site. After breakfast, travel by coach to this rugged region, where you’ll visit Echo Point to see the Three Sisters rock formation framed by eucalyptus forests. Take a short bushwalk to Wentworth Falls, enjoying the misty spray and serene trails. Savor a picnic lunch with valley views, then ride the Scenic Skyway cable car for a bird’s-eye perspective. Return to Sydney for dinner at leisure."
      },
      {
        "day": 4,
        "title": "Travel to Cairns",
        "description": "After breakfast, check out of your Sydney hotel and fly to Cairns (flight not included), the gateway to the Great Barrier Reef. Upon arrival, transfer to your new hotel near the waterfront, where you’ll settle into a room with tropical vibes. Spend the afternoon exploring Cairns Esplanade, swimming in the lagoon, or browsing the Night Markets for Aboriginal art and souvenirs. Enjoy a seafood dinner featuring barramundi or prawns, preparing for your reef adventure."
      },
      {
        "day": 5,
        "title": "Great Barrier Reef Snorkeling",
        "description": "Dive into the wonders of the Great Barrier Reef today. After an early breakfast, board a catamaran to the Outer Reef, where you’ll spend the day snorkeling among vibrant corals, tropical fish, and maybe even sea turtles. Your guide will provide equipment and a marine biology briefing, ensuring a safe and enriching experience. Enjoy a buffet lunch on board, then relax on deck with views of the turquoise waters. Return to Cairns for a well-deserved rest."
      },
      {
        "day": 6,
        "title": "Daintree Rainforest & Cape Tribulation",
        "description": "Explore Australia’s ancient wilderness with a day trip to Daintree Rainforest and Cape Tribulation. After breakfast, travel north to this UNESCO-listed rainforest, where you’ll walk through lush canopies, spot cassowaries, and cruise the Daintree River to see crocodiles. Enjoy a tropical lunch, then visit Cape Tribulation, where rainforest meets reef. Take a dip at a secluded beach before returning to Cairns for a farewell dinner featuring local delicacies."
      },
      {
        "day": 7,
        "title": "Departure",
        "description": "Enjoy a final breakfast with views of the Coral Sea, reflecting on your week of adventure. Take some time to stroll along Cairns’ waterfront or pick up last-minute souvenirs. Our team will transfer you to Cairns Airport for your departure, ensuring a smooth end to your journey through Sydney and the Great Barrier Reef’s wonders."
      }
    ],
    "inclusions": [
      "Luxury hotel accommodation",
      "Daily breakfast & 2 dinners",
      "Great Barrier Reef tour",
      "Sydney sightseeing tour"
    ],
    "exclusions": [
      "Flights to/from Australia",
      "Personal expenses"
    ],
    "accommodation": {
      "hotel_name": "Sydney Harbour Hotel",
      "rating": 5,
      "room_type": "Harbour View Suite",
      "photos": [
        "https://i.ibb.co.com/sJPnJ7KR/images-1-8.jpg",
        "https://i.ibb.co.com/BHyVSk3S/492477770.jpg",
        "https://i.ibb.co.com/1fN9VPfQ/a7811611-y.jpg",
        "https://i.ibb.co.com/JW1dfpzF/images-3-5.jpg",
        "https://i.ibb.co.com/svWXStDq/images-2-6.jpg",
        "https://i.ibb.co.com/xKgMwTJH/images-4.jpg"
      ]
    },
    "reviews": [
      {
        "id": 1,
        "user": {
          "name": "Emma Wilson",
          "location": "Vancouver, Canada",
          "avatar": "https://i.ibb.co.com/p6rZqfCQ/360-F-214746128-31-Jkea-P6r-U0-Nzzzd-FC4kh-Gkmqc8noe6h.jpg",
          "traveler_type": "Couple"
        },
        "rating": 5,
        "title": "Magical cherry blossom experience!",
        "review_text": "The cherry blossoms were breathtaking, and the cultural activities were so immersive. The tea ceremony was a highlight!",
        "date": "2024-04-01",
        "verified_booking": true,
        "photos": [
          "/reviews/tokyo-1.jpg"
        ],
        "helpful_count": 18,
        "response": {
          "text": "Thank you, Emma! We're so glad you enjoyed the cherry blossoms.",
          "date": "2024-04-03"
        }
      },
      {
        "id": 2,
        "user": {
          "name": "James Taylor",
          "location": "Auckland, New Zealand",
          "avatar": "https://i.ibb.co.com/Y4Kg8JsR/depositphotos-150975580-stock-photo-portrait-of-businesswoman-in-office.webp",
          "traveler_type": "Solo Traveler"
        },
        "rating": 4,
        "title": "Great tour, but busy",
        "review_text": "The tour was fantastic, but Tokyo was very crowded during cherry blossom season. Still, an amazing experience!",
        "date": "2024-04-10",
        "verified_booking": true,
        "photos": [],
        "helpful_count": 9,
        "response": {
          "text": "Thank you for your feedback, James! We'll work on managing the crowds better.",
          "date": "2024-04-12"
        }
      }
    ]
}
]